docs/posts/2015-02-24-father-forgive-them.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Apr 08, 2025 19:52 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Cross Shattered Christ, Chapter 1</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Cross Shattered Christ, Chapter 1</h1>
<p class="subtitle" role="doc-subtitle">Feb 24, 2015 00:00</p>
</header><p>
Reflections on <i>Cross-Shattered Christ: Meditations on the Seven Last Words</i> by Stanley Hauerwas, Chapter 1.
</p>



<p>
This chapter is perfect reading for the week following Ash Wednesday. The traditional liturgical declaration uttered by the minister &ldquo;Remember that you are dust, and to dust you shall return&rdquo; is a reminder of our mortality. Ash Wednesday is quickly forgotten, though, just as the somber reflection that occurs after a funeral quickly fades as life returns to normal. As Hauerwas points out, this death, the death of the Son of God, is like no other. To truly come terms with the death of Jesus is to understand that life can never return to normal. Jesus&rsquo; plea from the cross, &ldquo;Father, forgive them; for they do not know what they are doing,&rdquo; challenges our understanding both of God and of ourselves. In Hauerwas&rsquo; words, &ldquo;We are made members of a kingdom governed by a politics of forgiveness and redemption. The world is offered an alternative unimaginable by our sin-determined fantasies.&rdquo;<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> We are offered a glimpse of this kingdom in the lives of a few who are able to live in the shadow of the cross. May we find the strength to dwell there during this season of Lent.
</p>


<div class="tagline" id="org69ac2bb">
<p>
Tagged: <a href="../tags/religion.html">Religion</a>
</p>

</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes</h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Hauerwas, Stanley (2005-01-01). <b>Cross-Shattered Christ: Meditations on the Seven Last Words</b> (p. 18). Baker Publishing Group. Kindle Edition.
</p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Apr 08, 2025 19:52.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
